src-tauri/resources/download_request.xml

<Envelope xmlns="http://www.w3.org/2003/05/soap-envelope"
  xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://www.w3.org/2003/05/soap-envelope">
  <Header>
    <Action xmlns="http://www.w3.org/2005/08/addressing"
      xmlns:ns1="http://www.w3.org/2003/05/soap-envelope" ns1:mustUnderstand="1">
      http://www.microsoft.com/SoftwareDistribution/Server/ClientWebService/GetExtendedUpdateInfo2</Action>
    <MessageID xmlns="http://www.w3.org/2005/08/addressing">
      urn:uuid:5754a03d-d8d5-489f-b24d-efc31b3fd32d</MessageID>
    <To xmlns="http://www.w3.org/2005/08/addressing"
      xmlns:ns2="http://www.w3.org/2003/05/soap-envelope" ns2:mustUnderstand="1">
      https://fe3.delivery.mp.microsoft.com/ClientWebService/client.asmx/secured</To>
    <Security
      xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
      xmlns:ns3="http://www.w3.org/2003/05/soap-envelope" ns3:mustUnderstand="1"
      xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <Timestamp
        xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
        <Created>{{CREATED}}</Created>
        <Expires>{{EXPIRES}}</Expires>
      </Timestamp>
      <WindowsUpdateTicketsToken
        xmlns="http://schemas.microsoft.com/msus/2014/10/WindowsUpdateAuthorization"
        wsu:id="ClientMSA"
        xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
        xmlns:wuws="http://schemas.microsoft.com/msus/2014/10/WindowsUpdateAuthorization">
        <tickettype xmlns="http://www.w3.org/1999/xhtml" name="MSA" version="1.0" policy="MBI_SSL">
          <user></user>
        </tickettype>
        <tickettype xmlns="http://www.w3.org/1999/xhtml" name="AAD" version="1.0" policy="MBI_SSL"></tickettype>
      </WindowsUpdateTicketsToken>
    </Security>
  </Header>
  <Body>
    <GetExtendedUpdateInfo2
      xmlns="http://www.microsoft.com/SoftwareDistribution/Server/ClientWebService">
      <updateIDs>
        <UpdateIdentity>
          <UpdateID>{{UPDATE_ID}}</UpdateID>
          <RevisionNumber>{{REVISION_NUMBER}}</RevisionNumber>
        </UpdateIdentity>
      </updateIDs>
      <infoTypes>
        <XmlUpdateFragmentType>FileUrl</XmlUpdateFragmentType>
      </infoTypes>
      <deviceAttributes>
        E:BranchReadinessLevel=CBB&amp;DchuNvidiaGrfxExists=1&amp;ProcessorIdentifier=Intel64%20Family%206%20Model%2063%20Stepping%202&amp;CurrentBranch=rs4_release&amp;DataVer_RS5=1942&amp;FlightRing=Retail&amp;AttrDataVer=57&amp;InstallLanguage=en-US&amp;DchuAmdGrfxExists=1&amp;OSUILocale=en-US&amp;InstallationType=Client&amp;FlightingBranchName=&amp;Version_RS5=10&amp;UpgEx_RS5=Green&amp;GStatus_RS5=2&amp;OSSkuId=48&amp;App=WU&amp;InstallDate=1529700913&amp;ProcessorManufacturer=GenuineIntel&amp;AppVer=10.0.17134.471&amp;OSArchitecture=AMD64&amp;UpdateManagementGroup=2&amp;IsDeviceRetailDemo=0&amp;HidOverGattReg=C%3A%5CWINDOWS%5CSystem32%5CDriverStore%5CFileRepository%5Chidbthle.inf_amd64_467f181075371c89%5CMicrosoft.Bluetooth.Profiles.HidOverGatt.dll&amp;IsFlightingEnabled=0&amp;DchuIntelGrfxExists=1&amp;TelemetryLevel=1&amp;DefaultUserRegion=244&amp;DeferFeatureUpdatePeriodInDays=365&amp;Bios=Unknown&amp;WuClientVer=10.0.17134.471&amp;PausedFeatureStatus=1&amp;Steam=URL%3Asteam%20protocol&amp;Free=8to16&amp;OSVersion=10.0.17134.472&amp;DeviceFamily=Windows.Desktop</deviceAttributes>
    </GetExtendedUpdateInfo2>
  </Body>
</Envelope>